Test loss: 0.002484731065481901
Test accuracy: 0.81438786
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 28, 28, 16)        160       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 16)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 14, 14, 8)         1160      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 8)           0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 8)           584       
_________________________________________________________________
up_sampling2d (UpSampling2D) (None, 14, 14, 8)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 14, 14, 16)        1168      
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 28, 28, 16)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 28, 28, 1)         145       
=================================================================
Total params: 3,217
Trainable params: 3,217
Non-trainable params: 0
_________________________________________________________________






Epoch 1000/1000
60000/60000 [==============================] - 3s 50us/sample - loss: 0.0045 - acc: 0.8150 - val_loss: 0.0044 - val_acc: 0.8141
Test loss: 0.004423102010041475
Test accuracy: 0.81407017
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d (SeparableC (None, 28, 28, 16)        41        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 16)        0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 14, 14, 8)         280       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 7, 7, 8)           0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 7, 7, 8)           144       
_________________________________________________________________
up_sampling2d (UpSampling2D) (None, 14, 14, 8)         0         
_________________________________________________________________
separable_conv2d_3 (Separabl (None, 14, 14, 16)        216       
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 28, 28, 16)        0         
_________________________________________________________________
separable_conv2d_4 (Separabl (None, 28, 28, 1)         161       
=================================================================
Total params: 842
Trainable params: 842
Non-trainable params: 0
_________________________________________________________________
